podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
   private:
      /** Used to record interrupt state on entry */
      volatile uint32_t cpuSR;
   
   public:
      /**
       * Constructor - Enter critical section
       *
       * Disables interrupts for a critical section
       * This would be from the declaration of the object until end of enclosing block.
       */
      CriticalSection() __attribute__((always_inline)) {
         __asm__ volatile (
               "  MRS   r0, PRIMASK       \n"   // Copy flags
               // It may be possible for a ISR to run here but it
               // would save/restore PRIMASK so this code is OK
               "  CPSID I                 \n"   // Disable interrupts
               "  STR  r0, %[output]      \n"   // Save flags
               : [output] "=m" (cpuSR) : : "r0");
      }
   
      /**
       * Destructor - Exit critical section
       *
       * Enables interrupts IFF previously disabled by this object
       * This would be done implicitly by exiting the enclosing block.
       */
      inline ~CriticalSection() __attribute__((always_inline)) {
         __asm__ volatile (
               "  LDR r0, %[input]     \n"  // Retrieve original flags
               "  MSR  PRIMASK,r0;     \n"  // Restore
               : :[input] "m" (cpuSR) : "r0");
      }
   };
/* END Template:_common_settings.xml */

/*
 * Peripheral Information Classes
 */
/**
 * @addtogroup GPIO_Group GPIO, Digital Input/Output
 * @brief Abstraction for Digital Input/Output
 * @{
 */
#define USBDM_GPIOA_IS_DEFINED
/**
 * Peripheral information for GPIO, Digital Input/Output.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
/* gpio_def.xml */

#if defined(PCC_PCC_PORTA_CGC_MASK)
   /** Port information for PORTA */
   constexpr PortInfo  __attribute__((unused)) PortAInfo {PORTA_BasePtr, static_cast<uint32_t>(PCC_BasePtr+offsetof(PCC_Type, PCC_PORTA)), PORTA_IRQn, GPIOA_BasePtr, NvicPriority_NotInstalled};
#elif defined(SIM_SCGC5_PORTA_MASK)
#ifndef PORTA_IRQS
   /** Port information for PORTA */
   constexpr PortInfo  __attribute__((unused)) PortAInfo {PORTA_BasePtr, SIM_SCGC5_PORTA_MASK, IRQn_None, GPIOA_BasePtr, NvicPriority_NotInstalled};
#else
   constexpr IRQn_Type PORTA_IRQS_AR[] = PORTA_IRQS;
   /** Port information for PORTA */
   constexpr PortInfo  __attribute__((unused)) PortAInfo {PORTA_BasePtr, SIM_SCGC5_PORTA_MASK, PORTA_IRQS_AR[0], GPIOA_BasePtr, NvicPriority_NotInstalled};
#endif
#endif

class GpioAInfo {
public:
   // Template:gpioa_0x400ff000

   //! Number of signals available in info table
   static constexpr int numSignals  = 30;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: GPIOA_0              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: GPIOA_1              = PTA1(D9/J2_4/LED_RED)          */  { PortAInfo,  1,            (PcrValue)0x00100UL  },
         /*   2: GPIOA_2              = PTA2(D3/J1_8/LED_GREEN)        */  { PortAInfo,  2,            (PcrValue)0x00100UL  },
         /*   3: GPIOA_3              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   4: GPIOA_4              = PTA4(D4/J1_10)                 */  { PortAInfo,  4,            (PcrValue)0x00100UL  },
         /*   5: GPIOA_5              = PTA5(D16/J1_1)                 */  { PortAInfo,  5,            (PcrValue)0x00100UL  },
         /*   6: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   7: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   8: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*   9: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  10: GPIOA_10             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: GPIOA_11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: GPIOA_12             = PTA12(D18/J1_5)                */  { PortAInfo,  12,           (PcrValue)0x00100UL  },
         /*  13: GPIOA_13             = PTA13(D17/J1_3)                */  { PortAInfo,  13,           (PcrValue)0x00100UL  },
         /*  14: GPIOA_14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: GPIOA_15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: GPIOA_16             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  17: GPIOA_17             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: GPIOA_18             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  19: GPIOA_19             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  20: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  21: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  22: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  23: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  24: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  25: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  26: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  27: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  28: --                   = --                             */  { NoPortInfo, INVALID_PCR,  (PcrValue)0          },
         /*  29: GPIOA_29             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

