podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: GPIOC_0              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: GPIOC_1              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: GPIOC_2              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: GPIOC_3              = PTC3(D6/J1_14)                 */  { PortCInfo,  3,            (PcrValue)0x00100UL  },
         /*   4: GPIOC_4              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: GPIOC_5              = PTC5(D23/J1_15)                */  { PortCInfo,  5,            (PcrValue)0x00100UL  },
         /*   6: GPIOC_6              = PTC6(D7/J1_16)                 */  { PortCInfo,  6,            (PcrValue)0x00100UL  },
         /*   7: GPIOC_7              = PTC7(D21/J1_11)                */  { PortCInfo,  7,            (PcrValue)0x00100UL  },
         /*   8: GPIOC_8              = PTC8(D19/J1_7)                 */  { PortCInfo,  8,            (PcrValue)0x00100UL  },
         /*   9: GPIOC_9              = PTC9(D20/J1_9)                 */  { PortCInfo,  9,            (PcrValue)0x00100UL  },
         /*  10: GPIOC_10             = PTC10(D22/J1_13)               */  { PortCInfo,  10,           (PcrValue)0x00100UL  },
         /*  11: GPIOC_11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: GPIOC_12             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: GPIOC_13             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: GPIOC_14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: GPIOC_15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: GPIOC_16             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  17: GPIOC_17             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: GPIOC_18             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  19: GPIOC_19             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = 0x0100UL|PORT_GPCLR_GPWE(0x07E8UL);
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {

#if defined(PCC_PCCn_CGC_MASK)
PCC->PCC_PORTC = PCC_PCCn_CGC_MASK;
#else
enablePortClocks(PORTC_CLOCK_MASK);
#endif

PORTC->GPCLR = PinMux_Disabled|PORT_GPCLR_GPWE(0x0U);
   }

};

#define USBDM_GPIOD_IS_DEFINED
/**
 * Peripheral information for GPIO, Digital Input/Output.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
/* gpio_def.xml */

#if defined(PCC_PCC_PORTD_CGC_MASK)
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, static_cast<uint32_t>(PCC_BasePtr+offsetof(PCC_Type, PCC_PORTD)), PORTD_IRQn, GPIOD_BasePtr, NvicPriority_NotInstalled};
#elif defined(SIM_SCGC5_PORTD_MASK)
#ifndef PORTD_IRQS
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, SIM_SCGC5_PORTD_MASK, IRQn_None, GPIOD_BasePtr, NvicPriority_NotInstalled};
#else
   constexpr IRQn_Type PORTD_IRQS_AR[] = PORTD_IRQS;
   /** Port information for PORTD */
   constexpr PortInfo  __attribute__((unused)) PortDInfo {PORTD_BasePtr, SIM_SCGC5_PORTD_MASK, PORTD_IRQS_AR[0], GPIOD_BasePtr, NvicPriority_NotInstalled};
#endif
#endif

class GpioDInfo {
public:
   // Template:gpioa_0x400ff000

   //! Number of signals available in info table
   static constexpr int numSignals  = 16;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: GPIOD_0              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   1: GPIOD_1              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   2: GPIOD_2              = PTD2(D0/J1_2/SD_MOSI/BT_RX)    */  { PortDInfo,  2,            (PcrValue)0x00100UL  },
         /*   3: GPIOD_3              = PTD3(D1/J1_4/SD_MISO/BT_TX)    */  { PortDInfo,  3,            (PcrValue)0x00100UL  },
         /*   4: GPIOD_4              = PTD4(D10/J2_6)                 */  { PortDInfo,  4,            (PcrValue)0x00100UL  },
         /*   5: GPIOD_5              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   6: GPIOD_6              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: GPIOD_7              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: GPIOD_8              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   9: GPIOD_9              = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  10: GPIOD_10             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  11: GPIOD_11             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  12: GPIOD_12             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  13: GPIOD_13             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  14: GPIOD_14             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: GPIOD_15             = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {

