podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
   //! Hardware base pointer
   static constexpr HardwarePtr<SIM_Type> sim = baseAddress;

   // Template:sim_common_templates.xml
   
   #if defined(SIM_SOPT1_RAMSIZE)
   /**
    * Get RAM size
    *
    * @return RAM size value
    */
   static SimRamSize getRamSize() {
   
      return static_cast<SimRamSize>(sim->SOPT1&SIM_SOPT1_RAMSIZE_MASK);
   }
   #endif

   #if defined(SIM_SOPT1_OSC32KSEL)
   /**
    * Get ERCLK32K clock frequency
    *
    * @return Clock frequency as a uint32_t in Hz
    */
   static uint32_t getErc32kClock() {
   
      switch(sim->SOPT1&SIM_SOPT1_OSC32KSEL_MASK) {
         default                     : return 0;
         case SimOsc32kSel_Osc32kClk : return Osc0Info::getOsc32kClock();
         case SimOsc32kSel_Rtc32kClk : return RtcInfo::getExternalClock();
         case SimOsc32kSel_LpoClk    : return 1000;
      }
   }
   #endif

   /**
    * Set ERCLK32K clock source
    *
    * @param simOsc32kSel Clock source
    */
   static void setErc32kClock(SimOsc32kSel simOsc32kSel) {
      sim->SOPT1 = (sim->SOPT1&~SIM_SOPT1_OSC32KSEL_MASK) | simOsc32kSel;
   }

   //! System Options Register 1
   static constexpr uint32_t sopt1 = 
   #ifdef SIM_SOPT1_OSC32KOUT
      SIM_SOPT1_OSC32KOUT(0) |    // 32K oscillator clock out pin select
   #endif
      SIM_SOPT1_OSC32KSEL(2);     // 32K oscillator clock select

   /**
    * Selects the clock to output on the CLKOUT pin.
    *
    * @param simClkoutSel
    */
   static void setClkout(SimClkoutSel simClkoutSel) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_CLKOUTSEL_MASK) | simClkoutSel;
   }

   /**
    * Set Peripheral clock source
    *
    * @param simPeripheralClockSource Clock source for peripheral clock
    */
   static void setPeripheralClock(SimPeripheralClockSource simPeripheralClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_PLLFLLSEL_MASK) | simPeripheralClockSource;
   }

   /**
    * Get Peripheral clock frequency
    *
    * @return Frequency as a uint32_t in Hz
    *
    * @note If there is a peripheral clock divider then this is the frequency of the undivided peripheral clock
    */
   static uint32_t getPeripheralClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_PLLFLLSEL_MASK) {
         default:                     return 0;
         case SimPeripheralClockSource_McgFll : return SystemMcgFllClock;   // FLL clock
         case SimPeripheralClockSource_McgPll : return SystemMcgPllClock;   // PLL clock
   #if defined(USBPHY0_BasePtr)
         //case SimPeripheralClockSource_UsbPfd : return UsbPfdClock;         // USB PFD clock - not implemented
   #endif
   #if defined(USB_CLK_RECOVER_IRC_EN_REG_EN_MASK)                          // IRC 48MHz clock
         case SimPeripheralClockSource_Irc48m : return McgInfo::irc48m_clock;
   #endif
      }
   }

   #if defined(UART0_BasePtr)
   /** 
    * Get UART0 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart0Clock() {
      return SystemCoreClock;
   }
   #endif

   #if defined(UART1_BasePtr)
   /** 
    * Get UART1 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart1Clock() {
      return SystemCoreClock;
   }
   #endif

   #if defined(UART2_BasePtr)
   /** 
    * Get UART2 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart2Clock() {
      return SystemBusClock;
   }
   #endif

   #if defined(UART3_BasePtr)
   /** 
    * Get UART3 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart3Clock() {
      return 0;
   }
   #endif

   #if defined(UART4_BasePtr)
   /** 
    * Get UART4 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart4Clock() {
      return 0;
   }
   #endif

   #if defined(UART5_BasePtr)
   /** 
    * Get UART5 input clock frequency
    *
    * @return Clock frequency in Hz
    */
   static inline uint32_t getUart5Clock() {
      return 0;
   }
   #endif

   #if defined(LPUART0_BasePtr)
   /**
    * Set LPUART input clock source
    *
    * @param simLpuartClockSource Clock source for LPUART
    */
   static void setLpuartClock(SimLpuartClockSource simLpuartClockSource) {
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_LPUARTSRC_MASK) | simLpuartClockSource;
   }
      
   /**
    * Get LPUART input clock frequency
    *
    * @return Frequency as a uint32_t in Hz
    */
   static uint32_t getLpuartClock() {
      
      switch(sim->SOPT2&SIM_SOPT2_LPUARTSRC_MASK) {
      default:
      case SIM_SOPT2_LPUARTSRC(0): return 0;
   #if defined(SIM_CLKDIV3_PLLFLLFRAC_MASK)
      case SIM_SOPT2_LPUARTSRC(1): return getDividedPeripheralClock();
   #else
      case SIM_SOPT2_LPUARTSRC(1): return getPeripheralClock();
   #endif
      case SIM_SOPT2_LPUARTSRC(2): return Osc0Info::getOscerClock();
      case SIM_SOPT2_LPUARTSRC(3): return McgInfo::getMcgIrClock();
      }
   }
   #endif

   #ifdef SIM_SOPT2_USBSRC_MASK
   /**
    * Set USB Full-speed clock source
    *
    * If the internal clock is selected then the clock divider will be recalculated
    *      
    * @param simUsbFullSpeedClockSource Clock source for peripheral clock
    *
    * @return E_NO_ERROR on success
    */
   static ErrorCode setUsbFullSpeedClock(
                SimUsbFullSpeedClockSource simUsbFullSpeedClockSource = SimUsbFullSpeedClockSource_Peripheral) {
   
      // Set clock source
      sim->SOPT2 = (sim->SOPT2&~SIM_SOPT2_USBSRC_MASK) | simUsbFullSpeedClockSource;
   
      if (simUsbFullSpeedClockSource != SimUsbFullSpeedClockSource_Peripheral) {
         // Assume value provided by USBDM configuration is suitable
         sim->CLKDIV2 = 0;
         return E_NO_ERROR;
      }
      // Try to calculate value
      unsigned inputFreq = getPeripheralClock();
      for (unsigned frac = 0; frac < 2; frac++) {
         for (unsigned div = 0; div < 8; div++) {
            unsigned usbClock = (inputFreq * (frac+1))/(div+1);
            if (usbClock == 48000000) {
               // Found suitable value
               sim->CLKDIV2 = SIM_CLKDIV2_USBFRAC(frac)|SIM_CLKDIV2_USBDIV(div);
               return E_NO_ERROR;
            }
         }
      }
      return setAndCheckErrorCode(E_CLOCK_INIT_FAILED);
   }

   /**
    * Get USB clock frequency
    *
    * @return Clock frequency as a uint32_t in Hz
    */
   static uint32_t getUsbClock() {
      switch ((sim->SOPT2&SIM_SOPT2_USBSRC_MASK)) {
         default:
         case SimUsbFullSpeedClockSource_External   : return 48000000;
         case SimUsbFullSpeedClockSource_Peripheral : return  (getPeripheralClock()*
            (((sim->CLKDIV2&SIM_CLKDIV2_USBFRAC_MASK)>>SIM_CLKDIV2_USBFRAC_SHIFT)+1))/
            (((sim->CLKDIV2&SIM_CLKDIV2_USBDIV_MASK)>>SIM_CLKDIV2_USBDIV_SHIFT)+1);
      }
   }
   #endif

