podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
   #if defined(SIM_SOPT4_FTM3TRG0SRC_MASK)
   /**
    * Select FlexTimer 3 Hardware Trigger 0 Source
    *
    * @param simFtm3Trg0Src Trigger Source
    */
   static void setFtm3Trg0Src(SimFtm3Trg0Src simFtm3Trg0Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM3TRG0SRC_MASK)|simFtm3Trg0Src;   
   };
   #endif

   #if defined(SIM_SOPT4_FTM0TRG1SRC_MASK)
   /**
    * Select FlexTimer 0 Hardware Trigger 1 Source
    *
    * @param simFtm0Trg1Src Trigger Source
    */
   static void setFtm0Trg1Src(SimFtm0Trg1Src simFtm0Trg1Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0TRG1SRC_MASK)|simFtm0Trg1Src;   
   };
   #endif

   #if defined(SIM_SOPT4_FTM0TRG0SRC_MASK)
   /**
    * Select FlexTimer 0 Hardware Trigger 0 Source
    *
    * @param simFtm0Trg0Src Trigger Source
    */
   static void setFtm0Trg0Src(SimFtm0Trg0Src simFtm0Trg0Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0TRG0SRC_MASK)|simFtm0Trg0Src;   
   };
   #endif

   #if defined(SIM_SOPT4_FTM3CLKSEL_MASK)
   /**
    * Select FlexTimer 3 External Clock Pin
    *
    * @param simFtm3ClkSel Clock Pin
    */
   static void setFtm3ClkSel(SimFtm3ClkSel simFtm3ClkSel) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM3CLKSEL_MASK)|simFtm3ClkSel;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CLKSEL_MASK)
   /**
    * Select FlexTimer 2 External Clock Pin
    *
    * @param simFtm2ClkSel Clock Pin
    */
   static void setFtm2ClkSel(SimFtm2ClkSel simFtm2ClkSel) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM2CLKSEL_MASK)|simFtm2ClkSel;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM1CLKSEL_MASK)
   /**
    * Select FlexTimer 1 External Clock Pin
    *
    * @param simFtm1ClkSel Clock Pin
    */
   static void setFtm1ClkSel(SimFtm1ClkSel simFtm1ClkSel) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM1CLKSEL_MASK)|simFtm1ClkSel;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM0CLKSEL_MASK)
   /**
    * Select FTM0 External Clock Pin
    *
    * @param simFtm0ClkSel Clock Pin
    */
   static void setFtm0ClkSel(SimFtm0ClkSel simFtm0ClkSel) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0CLKSEL_MASK)|simFtm0ClkSel;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CH0SRC_MASK)
   /**
    * Select FTM2 channel 0 input capture source
    *
    * @param simFtm2Ch0Src Capture Source
    */
   static void setFtm2Ch0Src(SimFtm2Ch0Src simFtm2Ch0Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM2CH0SRC_MASK)|simFtm2Ch0Src;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM2CH1SRC_MASK)
   /**
    * Select FTM2 channel 1 input capture source
    *
    * @param simFtm2Ch1Src Capture Source
    */
   static void setSimFtm2Ch1Src(SimFtm2Ch0Src simFtm2Ch1Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM2CH1SRC_MASK)|simFtm2Ch1Src;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM1CH0SRC_MASK)
   /**
    * Select FTM1 channel 0 input capture source
    *
    * @param simFtm1Ch0Src Capture Source
    */
   static void setFtm1Ch0Src(SimFtm1Ch0Src simFtm1Ch0Src) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM1CH0SRC_MASK)|simFtm1Ch0Src;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM3FLT0_MASK)
   /**
    * Select FTM3 Fault 0 Select
    *
    * @param simFtm3Flt0 Fault Source
    */
   static void setFtm3Flt0(SimFtm3Flt0 simFtm3Flt0) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM3FLT0_MASK)|simFtm3Flt0;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM2FLT0_MASK)
   /**
    * Select FTM2 Fault 0 Select
    *
    * @param simFtm2Flt0 Fault Source
    */
   static void setFtm2Flt0(SimFtm2Flt0 simFtm2Flt0) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM2FLT0_MASK)|simFtm2Flt0;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM1FLT0_MASK)
   /**
    * Select FTM1 Fault 0 Select
    *
    * @param simFtm1Flt0 Fault Source
    */
   static void setFtm1Flt0(SimFtm1Flt0 simFtm1Flt0) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM1FLT0_MASK)|simFtm1Flt0;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM0FLT2_MASK)
   /**
    * Select FTM0 Fault 2 Select
    *
    * @param simFtm0Flt2 Fault Source
    */
   static void setFtm0Flt2(SimFtm0Flt2 simFtm0Flt2) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0FLT2_MASK)|simFtm0Flt2;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM0FLT1_MASK)
   /**
    * Select FTM0 Fault 1 Select
    *
    * @param simFtm0Flt1 Fault Source
    */
   static void setFtm0Flt1(SimFtm0Flt1 simFtm0Flt1) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0FLT1_MASK)|simFtm0Flt1;      
   };
   #endif

   #if defined(SIM_SOPT4_FTM0FLT0_MASK)
   /**
    * Select FTM0 Fault 0 Select
    *
    * @param simFtm0Flt0 Fault Source
    */
   static void setFtm0Flt0(SimFtm0Flt0 simFtm0Flt0) {
      sim->SOPT4 = (sim->SOPT4&~SIM_SOPT4_FTM0FLT0_MASK)|simFtm0Flt0;      
   };
   #endif

   #if defined(SIM_SOPT5_UART1RXSRC_MASK)
   /**
    * Select UART 1 receive data source
    *
    * @param simUart1RxSrc UART Rx source
    */
   static void setUart1RxSrc(SimUart1RxSrc simUart1RxSrc) {
      sim->SOPT5 = (sim->SOPT5&~SIM_SOPT5_UART1RXSRC_MASK)|simUart1RxSrc;      
   }
   #endif

   #if defined(SIM_SOPT5_UART1TXSRC_MASK)
   /**
    * Select UART 1 transmit data source select
    *
    * @param simUart1TxSrc UART Tx source
    */
   static void setUart1TxSrc(SimUart1TxSrc simUart1TxSrc) {
      sim->SOPT5 = (sim->SOPT5&~SIM_SOPT5_UART1TXSRC_MASK)|simUart1TxSrc;      
   }
   #endif

   #if defined(SIM_SOPT5_UART0RXSRC_MASK)
   /**
    * Select UART 0 receive data source
    *
    * @param simUart0RxSrc UART Rx source
    */
   static void setUart0RxSrc(SimUart0RxSrc simUart0RxSrc) {
      sim->SOPT5 = (sim->SOPT5&~SIM_SOPT5_UART0RXSRC_MASK)|simUart0RxSrc;      
   }
   #endif

   #if defined(SIM_SOPT5_UART0TXSRC_MASK)
   /**
    * Select UART 0 transmit data source select
    *
    * @param simUart0TxSrc UART Tx source
    */
   static void setUart0TxSrc(SimUart0TxSrc simUart0TxSrc) {
      sim->SOPT5 = (sim->SOPT5&~SIM_SOPT5_UART0TXSRC_MASK)|simUart0TxSrc;      
   }
   #endif

   //! System Options Register 5
   static constexpr uint32_t sopt5 = 
   #ifdef SIM_SOPT5_UART0TXSRC
      SIM_SOPT5_UART0TXSRC(0) |      // UART 0 transmit data source select
   #endif
   #ifdef SIM_SOPT5_UART0RXSRC
      SIM_SOPT5_UART0RXSRC(0) |      // UART 0 receive data source select
   #endif
   #ifdef SIM_SOPT5_UART1TXSRC
      SIM_SOPT5_UART1TXSRC(0) |      // UART 1 transmit data source select
   #endif
   #ifdef SIM_SOPT5_UART1RXSRC
      SIM_SOPT5_UART1RXSRC(0) |      // UART 1 receive data source select
   #endif
   #ifdef SIM_SOPT5_LPUART0RXSRC
      SIM_SOPT5_LPUART0RXSRC(0) |  // LPUART 0 receive data source select
   #endif
   #ifdef SIM_SOPT5_LPUART0TXSRC
      SIM_SOPT5_LPUART0TXSRC(-1) |  // LPUART 0 transmit data source select
   #endif
   #ifdef SIM_SOPT5_LPUART1TXSRC
      SIM_SOPT5_LPUART1TXSRC(-1) | // LPUART 1 transmit data source select
   #endif
   #ifdef SIM_SOPT5_LPUART1RXSRC
      SIM_SOPT5_LPUART1RXSRC(-1) | // LPUART 1 receive data source select
   #endif
      0;

   #if defined(SIM_SOPT7_ADC0TRGSEL_MASK)
   /**
    * Select the ADC0 Trigger source
    * 
    * If PDB is selected by SimAdc0Trigger then Pre-trigger 0/1 is determined by the PDB setup,
    * otherwise Pre-trigger 0/1 is determined by this parameter.
    * For example, setAdc0Triggers(SimAdc0TriggerMode_Alt_PreTrigger_1, SimAdc0Trigger_PitCh0) will set the trigger source
    * to PIT channel 0 and conversion will use SC1[1]/R[1]. 
    *
    * @param[in] simAdc0TriggerMode Select ADC0 Trigger mode 
    * @param[in] simAdc0Trigger     Select the ADC0 Trigger source in STOP and VLPS modes, or when ADC0 Alternative Trigger is active.
    */
   static void setAdc0Triggers(SimAdc0TriggerMode simAdc0TriggerMode, SimAdc0Trigger simAdc0Trigger=SimAdc0Trigger_PdbExTrig) {
      sim->SOPT7 = (sim->SOPT7&~(SIM_SOPT7_ADC0TRGSEL_MASK|SIM_SOPT7_ADC0ALTTRGEN_MASK))|simAdc0Trigger|simAdc0TriggerMode;
   }
   #endif

   #if defined(SIM_SOPT7_ADC1TRGSEL_MASK)
   /**
    * Select the ADC1 Trigger source
    * 
    * If PDB is selected by SimAdc0Trigger then Pre-trigger 0/1 is determined by the PDB setup,
    * otherwise Pre-trigger 0/1 is determined by this parameter.
    * For example, setAdc1Triggers(SimAdc1TriggerMode_Alt_PreTrigger_1, SimAdc1Trigger_PitCh0) will set the trigger source
    * to PIT channel 0 and conversion will use SC1[1]/R[1]. 
    *
    * @param[in] simAdc1TriggerMode Select ADC1 Trigger mode 
    * @param[in] simAdc1Trigger     Select the ADC1 Trigger source in STOP and VLPS modes, or when ADC0 Alternative Trigger is active.
    */
   static void setAdc1Triggers(SimAdc1TriggerMode simAdc1TriggerMode, SimAdc1Trigger simAdc1Trigger=SimAdc1Trigger_PdbExTrig) {
      sim->SOPT7 = (sim->SOPT7&~(SIM_SOPT7_ADC1TRGSEL_MASK|SIM_SOPT7_ADC1ALTTRGEN_MASK))|simAdc1Trigger|simAdc1TriggerMode;
   }
   #endif

   //! System Options Register 7
   static constexpr uint32_t sopt7 = 
   #ifdef SIM_SOPT7_ADC1ALTTRGEN
      SIM_SOPT7_ADC1ALTTRGEN(0) |    // ADC1 alternate trigger enable
      SIM_SOPT7_ADC1PRETRGSEL(0) |   // ADC1 pretrigger select
      SIM_SOPT7_ADC1TRGSEL(0) |      // ADC1 trigger select
   #endif
      SIM_SOPT7_ADC0ALTTRGEN(0) |    // ADC0 alternate trigger enable
      SIM_SOPT7_ADC0PRETRGSEL(0) |   // ADC0 pretrigger select
      SIM_SOPT7_ADC0TRGSEL(0);       // ADC0 trigger select

   #if defined(SIM_SOPT8_FTM0OCH0SRC)
   //! System Options Register 8
   static constexpr uint32_t sopt8 = 
      SIM_SOPT8_FTM3OCH7SRC(0) |   // FTM3 channel 7 output source
      SIM_SOPT8_FTM3OCH6SRC(0) |   // FTM3 channel 6 output source
      SIM_SOPT8_FTM3OCH5SRC(0) |   // FTM3 channel 5 output source
      SIM_SOPT8_FTM3OCH4SRC(0) |   // FTM3 channel 4 output source
      SIM_SOPT8_FTM3OCH3SRC(0) |   // FTM3 channel 3 output source
      SIM_SOPT8_FTM3OCH2SRC(0) |   // FTM3 channel 2 output source
      SIM_SOPT8_FTM3OCH1SRC(0) |   // FTM3 channel 1 output source
      SIM_SOPT8_FTM3OCH0SRC(3) |   // FTM3 channel 0 output source
      SIM_SOPT8_FTM0OCH7SRC(0) |   // FTM0 channel 7 output source
      SIM_SOPT8_FTM0OCH6SRC(0) |   // FTM0 channel 6 output source
      SIM_SOPT8_FTM0OCH5SRC(0) |   // FTM0 channel 5 output source
      SIM_SOPT8_FTM0OCH4SRC(0) |   // FTM0 channel 4 output source
      SIM_SOPT8_FTM0OCH3SRC(0) |   // FTM0 channel 3 output source
      SIM_SOPT8_FTM0OCH2SRC(0) |   // FTM0 channel 2 output source
      SIM_SOPT8_FTM0OCH1SRC(0) |   // FTM0 channel 1 output source
      SIM_SOPT8_FTM0OCH0SRC(0);    // FTM0 channel 0 output source
   #endif

