podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
   //! Hardware base pointer
   static constexpr HardwarePtr<PIT_Type> pit = baseAddress;

   /* Template_irqOptionSubstituted.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = PIT_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   //! Default value for PIT load value register
   static constexpr uint32_t pit_ldval  = 4799;

   //! PIT operation in debug mode
   static constexpr uint32_t mcr = 
      PIT_MCR_FRZ(0) |  // Freeze in debug mode
      PIT_MCR_MDIS(0);  // Disable

   /**
    * Get clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static __attribute__((always_inline)) uint32_t getClockFrequency() {
      return SystemBusClock;
   }

   /** 
    *  Enable clock to Pit
    */
   static void enableClock() {
#ifdef PCC
      PccInfo::enablePitClock();
#else
      SIM->SCGC6 = SIM->SCGC6 | SIM_SCGC6_PIT_MASK;
#endif
   }

   /** 
    *  Disable clock to Pit
    */
   static void disableClock() {
#ifdef PCC
      PccInfo::disablePitClock();
#else
      SIM->SCGC6 = SIM->SCGC6 & ~SIM_SCGC6_PIT_MASK;
#endif
   }

};

/** 
 * End group PIT_Group
 * @}
 */
/**
 * @addtogroup Power_Group POWER, Power
 * @brief Abstraction for Power
 * @{
 */
#define USBDM_POWER_IS_DEFINED
/**
 * Peripheral information for POWER, Power.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class PowerInfo {
public:
   // Template:power

   //! Number of signals available in info table
   static constexpr int numSignals  = 22;

   //! Information for each signal of peripheral
   static constexpr PinInfo  info[] = {

         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: VBAT                 = VBAT(VBAT)                     */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   1: VDD1                 = VDD1(VDD)                      */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   2: VDD2                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   3: VDD3                 = VDD3(VDD)                      */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   4: VDD4                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   5: VDD                  = VDD5(VDD5)                     */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   6: VDD6                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   7: VDD7                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*   8: VDDA                 = VDDA(VDDA)                     */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*   9: VOUT33               = VOUT33(VOUT33)                 */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  10: VREFH                = VREFH(VREFH)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  11: VREFL                = VREFL(VREFL)                   */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  12: VREGIN               = VREGIN(VREGIN)                 */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  13: VSS1                 = VSS1(VSS)                      */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  14: VSS1a                = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  15: VSS2                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  16: VSS3                 = VSS3(VSS)                      */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  17: VSS4                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  18: VSS                  = VSS5(VSS5)                     */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
         /*  19: VSS6                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  20: VSS7                 = --                             */  { NoPortInfo, UNMAPPED_PCR, (PcrValue)0          },
         /*  21: VSSA                 = VSSA(VSSA)                     */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

};

/** 
 * End group Power_Group
 * @}
 */
/**
 * @addtogroup RCM_Group RCM, Reset Control Module
 * @brief Abstraction for Reset Control Module
 * @{
 */
#define USBDM_RCM_IS_DEFINED
/**
 * Peripheral information for RCM, Reset Control Module.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class RcmInfo {
public:
   // Template:rcm_mk_ssrs

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = RCM_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<RCM_Type> rcm = baseAddress;

   //! Reset Pin Filter Control Register
   static constexpr uint8_t rcm_rpfc = 
      RCM_RPFC_RSTFLTSS(0)|   // Reset pin filter select in stop mode
      RCM_RPFC_RSTFLTSRW(0);  // Reset pin filter select in run and wait modes

   //! Reset pin filter bus clock select
   static constexpr uint8_t rcm_rpfw = 
      RCM_RPFW_RSTFLTSEL(0); 

};

/** 
 * End group RCM_Group
 * @}
 */
/**
 * @addtogroup RNGA_Group RNGA, Random Number Generator Accelerator
 * @brief Abstraction for Random Number Generator Accelerator
 * @{
 */
#define USBDM_RNGA_IS_DEFINED
/**
 * Peripheral information for RNGA, Random Number Generator Accelerator.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class RngaInfo {
public:
   // Template:rnga_0x40029000

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = RNGA_BasePtr;

