podonoghue/usbdm-firmware/TestClock_MK22F/Project_Headers/pin_mapping.h
         //      Signal                 Pin                                  portInfo    gpioBit                 PCR value
         /*   0: VREF_OUT             = VREF_OUT(D24)                  */  { NoPortInfo, FIXED_NO_PCR, (PcrValue)0          },
   };

   /**
    * Initialise pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void initPCRs() {
   }

   /**
    * Resets pins used by peripheral

    * @note Only the lower 16-bits of the PCR registers are affected
    */
   static void clearPCRs() {
   }

};

/** 
 * End group VREF_Group
 * @}
 */
/**
 * @addtogroup WDOG_Group WDOG, Watchdog Timer
 * @brief Abstraction for Watchdog Timer
 * @{
 */
#define USBDM_WDOG_IS_DEFINED
/**
 * Peripheral information for WDOG, Watchdog Timer.
 * 
 * This may include pin information, constants, register addresses, and default register values,
 * along with simple accessor functions.
 */
class WdogInfo {
public:
   // Template:wdog_mk

   //! Hardware base address as uint32_t 
   static constexpr uint32_t baseAddress = WDOG_BasePtr;

   //! Hardware base pointer
   static constexpr HardwarePtr<WDOG_Type> wdog = baseAddress;

   /* Template_irqOption.xml */

   //! IRQ numbers for hardware
   static constexpr IRQn_Type irqNums[]  = WDOG_IRQS;

   //! Number of IRQs for hardware
   static constexpr uint32_t irqCount  = sizeofArray(irqNums);

   //! Class based callback handler has been installed in vector table
   static constexpr bool irqHandlerInstalled = 0;

   //! Default IRQ level
   static constexpr NvicPriority irqLevel =  NvicPriority_NotInstalled;

   /**
    * Get input clock frequency
    *
    * @return Input clock frequency as a uint32_t in Hz
    */
   static uint32_t getInputClockFrequency() {
   
      switch(wdog->STCTRLH&WDOG_STCTRLH_CLKSRC_MASK) {
      default:
      case WDOG_STCTRLH_CLKSRC(0): return PmcInfo::getLpoClock(); // LPO
      case WDOG_STCTRLH_CLKSRC(1): return SystemBusClock;         // Alt = System Bus Clock
      }
   }

};

/** 
 * End group WDOG_Group
 * @}
 */
/** 
 * End group USBDM_Group
 * @}
 */

} // End namespace USBDM


// GPIO definitions are needed generally
#include "gpio.h"

///
/// @page PinSummary Pin Mapping
///
/// @section PinsByPinName Pins by Pin Name
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  EXTAL32        | -                             | EXTAL32                                            | EXTAL32                   | Reserved(Crystal)
///  RESET_b        |                               | RESET_b                                            | RESET_b                   | Reserved(Reset*)
///  USB0_DM        | -                             | USB0_DM                                            | USB0_DM                   | Reserved(USB_DM)
///  USB0_DP        | -                             | USB0_DP                                            | USB0_DP                   | Reserved(USB_DP)
///  XTAL32         | -                             | XTAL32                                             | XTAL32                    | Reserved(Crystal)
///
///
/// @section PinsByLocation Pins by Location
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  EXTAL32        | -                             | EXTAL32                                            | EXTAL32                   | Reserved(Crystal)
///  RESET_b        |                               | RESET_b                                            | RESET_b                   | Reserved(Reset*)
///  USB0_DM        | -                             | USB0_DM                                            | USB0_DM                   | Reserved(USB_DM)
///  USB0_DP        | -                             | USB0_DP                                            | USB0_DP                   | Reserved(USB_DP)
///  XTAL32         | -                             | XTAL32                                             | XTAL32                    | Reserved(Crystal)
///
///
/// @section PinsByFunction Pins by Peripheral
///
///   Pin Name      | C Identifier                  |  Functions                                         |  Location                 |  Description
///  -------------- | ------------------------------|--------------------------------------------------- | ------------------------- | ----------------------------------------------------
///  EXTAL32        | -                             | EXTAL32                                            | EXTAL32                   | Reserved(Crystal)
///  RESET_b        |                               | RESET_b                                            | RESET_b                   | Reserved(Reset*)
///  USB0_DM        | -                             | USB0_DM                                            | USB0_DM                   | Reserved(USB_DM)
///  USB0_DP        | -                             | USB0_DP                                            | USB0_DP                   | Reserved(USB_DP)
///  XTAL32         | -                             | XTAL32                                             | XTAL32                    | Reserved(Crystal)
///
///

#endif /* PROJECT_HEADERS_PIN_MAPPING_H */
